[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-Brunoenr02/Bank/Bank.Domain/BankAccount.cs:57:17
         public void Debit(double amount)
         {
             if (amount < 0)
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
+                ;
 
             if (amount > m_balance)
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsNegative_ShouldThrowArgumentOutOfRange_WithMessage; Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRange

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-Brunoenr02/Bank/Bank.Domain/BankAccount.cs:59:17
             if (amount < 0)
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
 
-            if (amount > m_balance)
+            if (amount >= m_balance)
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
 
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsEqualToBalance_ShouldSetBalanceToZero

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-Brunoenr02/Bank/Bank.Domain/BankAccount.cs:59:17
             if (amount < 0)
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
 
-            if (amount > m_balance)
+            if (amount < m_balance)
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
 
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountExceedsBalance_ShouldThrowArgumentOutOfRange_WithMessage; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-Brunoenr02/Bank/Bank.Domain/BankAccount.cs:60:17
                 throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountLessThanZeroMessage);
 
             if (amount > m_balance)
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, DebitAmountExceedsBalanceMessage);
+                ;
 
             m_balance -= amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountExceedsBalance_ShouldThrowArgumentOutOfRange_WithMessage; Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsMoreThanBalance_ShouldThrowArgumentOutOfRange

[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-Brunoenr02/Bank/Bank.Domain/BankAccount.cs:75:17
         public void Credit(double amount)
         {
             if (amount < 0)
-                throw new ArgumentOutOfRangeException(nameof(amount), amount, CreditAmountLessThanZeroMessage);
+                ;
 
             m_balance += amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRange_WithMessage
